# git add - выложить в гид хаб только один файл, выборочно
#  git add . - выложить все файлы
# git commit -m 'first commit' - С помощью него создаются новые проекты. 
#  git commit -m 'сохранил дз 2 месяца' - Не повторяться 
# git init -создает локальный репозитори. Команды для пуша на новый репоризиторий.
# git branch -M - Меняет название ветки
#  Команды - помощники
# git status

# git branch - показывает как ветки существуют

"""
Комнады для работы с ветками

git branch 

git checkout -b (olya) - Создает новыую ветку

"""

"""
Команды для пуша на существующий репозиторий 

git add .

git commit -m "create test.py"

git push
"""